/******************************************************************************
  Copyright (C), 2013-2016,  DiHongLongXi（帝鴻龍曦）
  
  File name: Aurora_Base_Config.c

  Author: DHLX    Version: v0.10.0    Date: 2016.04.26

  Description: 初始化芯片的各项外设、管脚配置    

  Others:         

  Function List:  
  
  Num. | function prototypes     | Description 
    1. | void System_Init(void)  | 系统配置初始化函数

  History:        
    
  Num. |    Date    |  Author  |  Modification
    1. | 2016.04.26 |   DHLX   |  创建文件和System_init()   
******************************************************************************/

/* Includes -----------------------------------------------------------------*/
#include "..\ProgInc\Aurora_Base_Config.H"

/* Private typedef ----------------------------------------------------------*/

/* Private define -----------------------------------------------------------*/

/* Private macro ------------------------------------------------------------*/

/* Private variables --------------------------------------------------------*/ 

/* Private constants --------------------------------------------------------*/

/* Private function prototypes ----------------------------------------------*/

/* Private functions --------------------------------------------------------*/

/* Exported functions -------------------------------------------------------*/

/******************************************************************************

  Function:       void System_Init(void)

  Description:    系统配置初始化函数

  Calls:          None

  Called By:      1、void main(void);

  Input:          None

  Output:         None

  Return:         None

  Others:         None

  Version:        V0.10.0,2016-02-26

******************************************************************************/

void System_Init(void)
{
/** 初始化管脚配置，默认输出高电平，双向*****************************************/
    P1M0 = 0x00;
    P1M1 = 0x00;
    P1   = 0xFF;
    
    P3M0 = 0x00;
    P3M1 = 0x00;
    P3   = 0xFF;
    
    P5M0 = 0x00;
    P5M1 = 0x00;
    P5   = 0xFF;
/*****************************************************************************/
    
/** 初始化Timer配置************************************************************/
    AUXR |= 0x80;		//定时器时钟1T模式
    TMOD &= 0xF0;		//设置定时器模式
    TL0 = 0x74;		//设置定时初值
    TH0 = 0xF5;		//设置定时初值
    TF0 = 0;		//清除TF0标志
    TR0 = 1;		//定时器0开始计时
/*****************************************************************************/ 
    
/** 初始化AD配置，P10设置成AD端口***********************************************/
    P1ASF = 0x01;                   //设置P10口为AD口
    ADC_RES = 0;                    //清除结果寄存器
    ADC_CONTR = ADC_POWER | ADC_SPEEDLL;
/*****************************************************************************/
    
/** 初始化PWM配置，默认是P34、P35、P36、P37，SYSCLK/2,7位,100%高电平输出*********/  
    ACC = P_SW1;
    ACC &= ~RGB_Port;      
    ACC |= RGB_Port;       
    P_SW1 = ACC;

    CCON = 0;                       //初始化PCA控制寄存器
    //PCA定时器停止
    //清除CF标志
    //清除模块中断标志
    CL = 0;                         //复位PCA寄存器
    CH = 0;
    CMOD = 0x02;                    //设置PCA时钟源
    //允许PCA定时器溢出中断

    PCA_PWM0 = 0x03;                //PCA模块0工作于8位PWM
    R_BUS_RMS = 255;                   
    CCAPM0 = 0x53;                 

    PCA_PWM1 = 0x03;                
    G_BUS_RMS = 255;
    CCAPM1 = 0x53;

    PCA_PWM2 = 0x03;                
    B_BUS_RMS = 255;
    CCAPM2 = 0x53;
    
    BUS_CLOSE();
/*****************************************************************************/ 

/** 初始化串口配置，9600,N,8,1****************************/
    PCON &= 0x7F;		/*波特率不倍速*/
    SCON = 0x50;		/*8位数据,可变波特率*/
    AUXR |= 0x04;		/*独立波特率发生器时钟为Fosc,即1T*/
    BRT = 0xA8;		  /*设定独立波特率发生器重装值*/
    AUXR |= 0x01;		/*串口1选择独立波特率发生器为波特率发生器*/
    AUXR |= 0x10;		/*启动独立波特率发生器*/
/*****************************************************************************/   
/** 系统总中断默认为开**********************************************************/
    EA = 1;   
/*****************************************************************************/ 
}

/*********** (C) COPYRIGHT DiHongLongXi（帝鴻龍曦）*****END OF FILE************/
